# WireConduitTypeSet Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
WireConduitTypeSet Class
Members See Also
---
A set that contains conduit types.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class WireConduitTypeSet : APIObject,
	IEnumerable
```

Visual Basic
---
```text
Public Class WireConduitTypeSet _
	Inherits APIObject _
	Implements IEnumerable
```

Visual C++
---
```text
public ref class WireConduitTypeSet : public APIObject,
	IEnumerable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..APIObject Autodesk.Revit.DB.Electrical..::..WireConduitTypeSet
# See Also
WireConduitTypeSet Members
Autodesk.Revit.DB.Electrical Namespace